print("Добрый день! Введите 1 элемент геометрической прогрессии(Допустимые значения -10_000 ≤ b ≤ 10_000)")
b=int(input())
print("Введите множитель геометрической прогрессии(Допустимые значения 1 ≤ q ≤ 50)")
q=int(input())
print("Введите номер последнего элемента геометрической прогрессии(Допустимые значения 2 ≤ n ≤ 100)")
n=int(input())
s=b * (q**n - 1) // (q - 1)
if   -10_000 <= b <= 10_000 and 1 <= q <= 50 and 2 <= n <= 100 :
    print("Сумма геометрической прогрессии равна", s)
else:
    print("Введены недопустимые значения ")

